import os
import datetime

IP_NUM = 1      # 每天限制数
IP_TOTAL = 4    # 每阶限制数
DEVICE_NUM = 1      # 每天限制数
DEVICE_TOTAL = 4    # 每阶限制数
VOTE_MIN = 6
VOTE_MAX = 20
START_DATE = datetime.date(2024,10,29) #TODO 配置项
END_DATE = datetime.date(2024,11,3)
PERIOD = 6
BASE_DIR = './zq_topten_backend/'
PIC_PATH = BASE_DIR+'PIC_PATH/'
PIC_HIS_PATH = BASE_DIR+'PIC_HISTORY_PATH/'
PIC_URL = '/photo/'
PIC_HIS_URL = '/historyphoto/'
IP_whiteList = (
    # ('192.168.0.233', '192.168.0.233', 10, 100),  添加其为信任的IP, 信任投票次数为每天10次, 本阶段总共100次
    ('127.0.0.1', '127.0.0.1', 6, 60),
    ('59.172.0.0', '59.172.255.255', 6, 60),
    ('58.19.25.0', '58.19.25.31', 6, 60),
    ('125.220.128.0', '125.220.255.255', 6, 60),
    ('202.114.64.0', '202.114.255.255', 6, 60),
    ('183.86.194.0', '183.86.194.255', 0, 0),
    ('223.104.20.0', '223.104.20.255', 0, 0),
    ('220.202.152.0', '220.202.152.255', 0, 0),
    ('218.197.152.0', '218.197.153.255', 6, 60),
    #('113.57.0.0', '113.57.255.255', 0, 0),
)
